Repository: OmarAlgammal/ali_mobile_store
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Register as employer
ar: التسجيل كصاحب العمل

source: Register as employee
ar: التسجيل كموظف

source: Wrong password
ar: الرقم السري غير صحيح

source: The name
ar: الاسم

# phoneNum
source: Phone number
ar: رقم الهاتف

# enterThePhoneNum
source: Enter the phone number
ar: أدخل رقم الهاتف

# enterThePhoneNumCorrectly
source: Enter The phone number correctly
ar: أدخل رقم الهاتف بشكل صحيح

# youShouldEnterThePhoneNum
source: You should enter the phone number
ar: يجب ادخال رقم الهاتف

# invalidPhoneNum
source: Invalid phone number
ar: رقم هاتف غير صالح

# error
source: An error occurred
ar: حدث خطأ

source: Verify
ar: التحقق

source: Enter the password
ar: ادخل الرقم السري

source: Enter the password first
ar: أدخل الرقم السري أولا

# shortPassword
source: The password cannot be less than 6 digits
ar: لا يمكن أن يكون الرقم السري اقل من 6 أرقام

# waitingOTP
source: waiting to automatically detect an SMS sent to
ar: تم ارسال رمز في رسالة نصية الي

source: Change your num?
ar: تغييرالرقم؟

# enterOtpNum
source: Enter 6 digit code
ar: ادخل الكود المكون من 6 أرقام

# verifyPhoneNum
source: Verify phone number
ar: التحقق من رقم الهاتف

# resendOtp
source: Resend SMS
ar: اعادة ارسال الرمز

source: Invalid OTP
ar: رقم OTP غير صحيح

# waitingForYouToBeAccepted
source: في انتظار قبولك من قبل صاحب العمل
ar: Wanting for you to be accepted by the employer

source: Submit
ar: إرسال

source: You should enter the name first
ar: يجب إدخال الاسم أولا

source: The name is too short
ar: الاسم قصير جدا

source: To the store
ar: إلي المتجر

source: No installments today
ar: لا توجد أقساط اليوم

source: No installments tomorrow
ar: لا توجد أقساط الغد

source: No missed installments
ar: لا توجد أقساط متأخرة

source: No installments in this date
ar: لا توجد أقساط في هذا التاريخ

source: Installments List Is Empty
ar: قائمة الأقساط فارغه

# thereIsNoCompleteInstallments
source: No completed Installments
ar: لا توجد أقساط مكتملة

# youAreOffline
source: You can't update the data when you are offline
ar: لا يمكنك تعديل البيانات وأنت غير متصل بالانترنت

source: Saved
ar: تم الحفظ

source: adjustment saved
ar: تم حفظ التعديلات

source: Retreat
ar: تراجع

# myStore
source: store management
ar: المتجر

source: complete installments
ar: الأقساط المكتملة

source: installments list
ar: قائمة الأقساط

source: Today Installments
ar: أقساط اليوم

# installmentData
source: Installments Data
ar: بيانات القسط

# updateInstallmentData
source: Update Installments Data
ar: تحديث بيانات القسط

source: Client Name
ar: اسم العميل

source: Client Number
ar: رقم هاتف العميل

source: Client ID
ar: الرقم القومي للعميل

source: Guarantor Name
ar: اسم الضامن

source: Guarantor Number
ar: رقم هاتف الضامن

source: Guarantor ID
ar: الرقم القومي للضامن

# brandName
source: Phone Brand
ar: نوع الهاتف

source: Phone Name
ar: اسم الهاتف

source: Phone Price
ar: سعر الهاتف

source: Advanced Amount
ar: المقدم

source: Installment Period
ar: فترة التقسيط

# theRest
source: Rest
ar: الباقي

# theProfit
source: Profit
ar: الفائدة

source: Paid Monthly
ar: يدفع شهريا

source: Received Date
ar: تاريخ الاستلام

# clientNamePlease
source: Enter Client Name Please
ar: ادخل اسم العميل من فضلك

# clientNumberPlease
source: Enter Client Number Please
ar: يجب ادخال رقم العميل

# clientIdPlease
source: Enter Client ID Please
ar: يجب ادخال رقم بطاقة العميل كاملا

# guarantorNamePlease
source: Enter Guarantor Name Please
ar: ادخل اسم الضامن من فضلك

# guarantorNumberPlease
source: Enter Guarantor Number Please
ar: يجب ادخال رقم الضامن

# guarantorIdPlease
source: Enter Guarantor ID Please
ar: يجب ادخال رقم بطاقة الضامن كاملا

# brandPlease
source: Determine Phone Brand Please
ar: يجب تحدبد نوع الهاتفا

# phoneNamePlease
source: Determine Phone Name PLease
ar: يجب تحدبد اسم الهاتفا

# phonePricePlease
source: Enter Phone Price Please
ar: ادخل سعر الهاتف من فضلك

# phonePriceCant
source: Phone Price Cant't Be Negative Value
ar: لا يمكن ان يكون سعر الهاتف بقية سالبة

# advancedAmountPlease
source: Enter Advanced Amount Please
ar: ادخل المقدم من فضلك

# advancedAmountCant
source: Advanced Amount Cant't Be Negative Value
ar: لا يمكن ان يكون المقدم بقيمة سالبة

# installmentPeriodPlease
source: Enter Installment Period Please
ar: ادخل فترة القسط من فضلك

# installmentPeriodCant
source: Installment Period Can't Be Negative Value
ar: لا يمكن ان تكون فترة التقسيط بقيمة سالبة

source: Show
ar: عرض

source: Save
ar: حفظ

source: Pay
ar: ادفع

source: Ok
ar: موافق

source: Cancel
ar: إلغاء

source: ُEnter payment amount
ar: أدخل قيمة الدفع

source: Client Data
ar: بيانات العميل

source: Installments Record
ar: سجل الأقساط

source: Total
ar: الإجمالي

source: Paid from installments
ar: المدفوع من الأقساط

source: Installment Price
ar: سعر القسط

source: The Amount Paid
ar: المبلغ المدفوع

source: Installment Date
ar: تاريخ القسط

# paymentDate
source: Date Of Payment
ar: تاريخ السداد

source: Pound
ar: جنية

source: month
ar: شهر

source: months
ar: شهور

source: and
ar: و

# installmentNum
source: Installment Number
ar: قسط رقم

source: from
ar: من

# endTheInstallmentByPaying
source: Biggest Price To Pay:
ar: أنهاء القسط بدفع :

source: Late Receivables:
ar: المستحقات المتأخرة :

source: Rest from original phone price :
ar: باقي من سعر الهاتف الأصلي :

source: Rest from profit of agreement:
ar: باقي من فوائد الاتفاق :

# additionalProfitNumOne
source: Additional Profit Have Been Added To The Client In The Amount Of
ar: تمت إضافة فوائد اضافية علي العميل بقيمة

# additionalProfitNumTwo
source: Pound For Bing Late For The Payment Date By
ar: جنية لتأخره عن ميعاد الدفع

# additionalProfitNumThree
source: Days. To confirm The Additional Profit Click On The Box In The left Side
ar: يوم. ولتأكيد الفائدة الإضافيه اضغط علي الصندوق جهة اليمين

source: Installment was end with additional Profit of
ar: تم انهاء القسط بمكسب اضافي بقيمة

# installmentWasEndWithAtALoseOne
source: Installment was end with a lose of
ar: تم انهاء القسط بخسارة

# installmentWasEndWithAtALoseTwo
source: from original phone price
ar: من سعر الهاتف الأصلي

# installmentWasEndWithAtALoseThree
source: from profit in deal in total
ar: من الفوائد المتفق عليها باجمالي

# additionalProfitWarning
source: additional profit will be calculated from tomorrow
ar: سيتم احتساب الفائدة الإضافيه من الغد

source: Calling Client
ar: اتصل بالعميل

source: Calling Guarantor
ar: اتصل بالضامن

source: Payment Record
ar: سجل الدفع

source: Update Client Data
ar: تحديث بيانات العميل

source: End the installment
ar: انهاء القسط

source: End the installment with a lose of
ar: انهاء القسط بخسارة

source: From original phone price :
ar: من سعر الهاتف الأصلي :

source: From profit until know :
ar: من الفائدة حتي الأن :

source: Enter the amount
ar: أدخل القيمة

source: You can't pay zero in this case
ar: لا يمكنك الدفع بصفر في هذه الحالة

source: Complete Installments Can Not Be Updated
ar: لا يمكن تحديث الأقساط المكتملة

source: This amount is greater than termination Amount
ar: ذا الرقم أكبر من قيمة انهاء القسط

# amountPaidIsBiggerThanRequiredOne
source: The amount paid cannot be bigger than sum of the rest and profit
ar: لا يمكن أن يكون المبلغ المدفوع أكبر من مجموع الباقي والفائدة

# amountPaidIsBiggerThanRequiredTwo
source: The amount paid cannot be bigger than or equal to biggest price to pay
ar: لا يمكن أن يكون المبلغ المدفوع أكبر من أو مساو لأقصي مبلغ للدفع

source: Tomorrow Installments
ar: اقساط الغد

source: Missed Installments
ar: الأقساط المتأخرة

source: Determine Date
ar: حدد التاريخ

source: Select Date
ar: اختر التاريخ

source: Loading..
ar: جار التحميل..

source: Clients
ar: العملاء

source: State
ar: الحالة

# da
source: date/time
ar: تاريخ/قيمة

source: canceled
ar: ملغي

source: Paid
ar: مدفوع

source: Today
ar: اليوم

source: Late
ar: متأخر

source: Next
ar: القادم
